Revit 2027 API
FaceDetailNode.GetInstanceTransform Method
 Returns instance transform of the object being drawn.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetInstanceTransform()
Public Function GetInstanceTransform As Transform
public:
Transform^ GetInstanceTransform()
member GetInstanceTransform : unit -> Transform
Return Value
Transform
See Also
Reference
FaceDetailNode Class
Autodesk.Revit.DB Namespace